---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ProductLongDescription
source: html/512817e5-7a93-dddb-4f06-6b1f9efd07ff.htm
---
# Autodesk.Revit.DB.FabricationPart.ProductLongDescription Property

The product long description of the fabrication part.

## Syntax (C#)
```csharp
public string ProductLongDescription { get; }
```